[
  {
    "slug": "roadmapclosedbeta",
    "title": "Pirate Arena: 2025 Closed Beta Roadmap",
    "category": "Road Map",
    "displayDate": "August 5, 2025",
    "publishedAt": "2025-08-05T07:00:00.000Z",
    "thumbnailUrl": "https://i.imgur.com/W9Xs4Yl.png",
    "headerImageUrl": "https://i.imgur.com/F6ijKDQ.png",
    "summary": "Closed beta roadmap details, character plans, and Pirate Arena design philosophy.",
    "content": "<div class=\"table-of-contents\">\r\n  <h2>Table of Contents</h2>\r\n  <ul>\r\n    <li><a href=\"#closed-beta-1-roadmap\">Closed Beta #1 Roadmap</a></li>\r\n    <li><a href=\"#closed-beta-2-roadmap\">Closed Beta #2 Roadmap</a></li>\r\n    <li><a href=\"#end-of-closed-beta\">End of Closed Beta</a></li>\r\n    <li><a href=\"#character-design-philosophy\">Character Design Philosophy</a></li>\r\n    <li><a href=\"#pirate-arena-goals\">Pirate Arena Goals</a></li>\r\n  </ul>\r\n</div>                  \r\n\r\n<h2 id=\"closed-beta-1-roadmap\">Closed Beta #1 Roadmap</h2>\r\n  <ol>\r\n    <li>Our goal for Closed Beta #1 is to release content up through the <strong>Alabasta Saga</strong>.</li>\r\n    <li>Characters available during and after Closed Beta may change at any time as we change the game.</li>\r\n    <li>Please note that any characters or cosmetics purchased with Berries during Closed Beta will <strong>not</strong> carry over after Closed Beta ends.</li>\r\n    <li>Character releases during this phase will happen quickly and without official news posts on the website, all updates will be shared through our Public Discord.</li>\r\n  </ol>\r\n\r\n<h2 id=\"closed-beta-2-roadmap\">Closed Beta #2 Roadmap</h2>\r\n\r\n  <ol>\r\n    <li>Development of the <strong>Forum</strong> will begin to enhance community interaction.</li>\r\n    <li>We plan to release characters from the <strong>Sky Island Saga</strong> and <strong>Water 7 Saga</strong> during this period.</li>\r\n    <li>Cosmetic creation and customization options will start.</li>\r\n    <li>The <strong>Closed Beta Battle Pass</strong> will launch, offering exclusive rewards.</li>\r\n    <li>Work on the <strong>Cosmetic Shop</strong> will begin.</li>\r\n  </ol>\r\n\r\n<h3 id=\"end-of-closed-beta\">End of Closed Beta</h3>\r\n\r\n  <p>This marks the conclusion of the Closed Beta phases.</p>\r\n\r\n<h2 id=\"character-design-philosophy\">Character Design Philosophy</h2>\r\n\r\n  <p><strong>One Piece Arena</strong> aims to create characters that range from simple to complex, all balanced within the existing cast. Each staff member designing characters is assigned specific roles they must achieve. These roles include:</p>\r\n\r\n  <h3>\"Fill\" Characters</h3>\r\n  <p>These characters are created to fill out the roster and support various team archetypes such as Stun, Counter, Reflect, and more.</p>\r\n\r\n  <h3>\"Strategic\" Characters</h3>\r\n  <p>This category focuses on long-term stacking and multi-turn defenses to \"slow\" down gameplay. They are balanced so that your average \"fill\" character can still deal at least 40% damage despite these defenses or stacks.</p>\r\n\r\n  <h3>\"Unique\" Characters</h3>\r\n  <p>The staff tasked with creating unique characters focus on giving players a true sense of playing as that character. This goes beyond simple logic like \"Affliction - Poison - Magellan\" and delves into questions such as \"How would Magellan’s poison target a team? Is the poison omnipotent?\" This design grants players the immersive feeling of embodying that character.</p>\r\n\r\n<h2 id=\"pirate-arena-goals\">Pirate Arena Goals</h2>\r\n\r\n  <p><strong>Pirate-Arena’s</strong> goal is to create an arena experience designed to be enjoyed in-between other games and arenas, while still delivering that insatiable feeling for players who want to dedicate their full time.</p>\r\n\r\n  <p>To achieve this, Pirate-Arena has implemented the following for Missions:</p>\r\n\r\n  <ul>\r\n    <li>\r\n      <strong>Character Shop:</strong>  \r\n      Berries are earned through Missions, Events, and Ladder Games. These berries represent your in-game bounty and can be spent to buy characters and complete their associated missions. This system allows players to unlock characters beyond their initial rank and counters the idea that staff release broken characters just to make money.\r\n    </li>\r\n    <li>\r\n      <strong>Patreon:</strong>  \r\n      Instead of limiting character unlocks to Patreon supporters, Patreon is used to support the ongoing growth of Pirate-Arena. Currently, one of the owners, Lily, funds hosting, domain, and ads personally. Additional Patreon revenue will go toward advertising to help expand Pirate-Arena’s reach, not just cover hosting costs. Even if Patreon contributions are low, the team will continue promoting the game through every available channel.\r\n    </li>\r\n    <li>\r\n      <strong>Pirate Missions:</strong>  \r\n      We are moving away from traditional “Win X in a row” missions (which will be capped at 3 max if they appear). Instead, missions will become more dynamic and less generic, details will be shared later. Missions will also reward more than just characters; you’ll earn cosmetics, berries, and multiple characters through these challenges.\r\n    </li>\r\n  </ul>"
  }
]